Revit 2027 API
Profile.Clone Method
Returns a copy of this profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Profile Clone()
Public Function Clone As Profile
public:
Profile^ Clone()
member Clone : unit -> Profile
Return Value
Profile
See Also
Reference
Profile Class
Autodesk.Revit.DB Namespace